#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_PROD.module.moh_applications.module.FORMS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + base_url                                  = "https://forms.hlth.gov.bc.ca/"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "FORMS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Ministry of Health Public Forms Server"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "FORMS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://dmz1.forms.hlth.gov.bc.ca/*",
          + "https://dmz2.forms.hlth.gov.bc.ca/*",
          + "https://forms-tmp.hlth.gov.bc.ca/*",
          + "https://forms.hlth.gov.bc.ca/*",
          + "https://logon7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://sts.healthbc.org/adfs/ls/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FORMS.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FORMS.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "address",
          + "microprofile-jwt",
          + "offline_access",
          + "phone",
        ]
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FORMS.keycloak_openid_user_attribute_protocol_mapper.idir_company will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_company" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = false
      + aggregate_attributes = false
      + claim_name           = "idir_company"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_company"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_company"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.FORMS.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "50b0f51c-7083-4303-b946-2023781df0df"
        name                                       = "FORMS"
      ~ valid_redirect_uris                        = [
          + "https://dmz1.formstst.hlth.gov.bc.ca/*",
          + "https://dmz2.formstst.hlth.gov.bc.ca/*",
          - "https://forms.ddev.site/*",
          - "https://formsdev.hlth.gov.bc.ca/*",
            # (3 unchanged elements hidden)
        ]
        # (24 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ahoplock, Action: `pull_request`*